БИТУправление_медицинским_центром_демо/src/DataProcessors/УниверсальныйПоискКлиентов/УниверсальныйПоискКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УниверсальныйПоискКлиентов</name>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Documents/ЛистОжидания/ЛистОжидания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистОжидания</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Прием</basedOn>
  <basedOn>Document.Событие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыполнения</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЛистаОжидания</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеСодержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнееСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗаписи</name>
    <type>
      <types>CatalogRef.ПричиныЗаписиНаПрием</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЖелаемоеВремя</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Окончание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмененияПериода</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/DataProcessors/УниверсальныйПоискКлиентов/Forms/ФормаСозданияЛистовОжидания/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодЗаписи.ДатаНачала = НачалоДня(ТекущаяДата() + 86400);
	ПериодЗаписи.ДатаОкончания = ПериодЗаписи.ДатаНачала;
	ПричинаЗаписи = Справочники.ПричиныЗаписиНаПрием.КонтрольныйОсмотр;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	СписокКлиентов = Параметры.СписокКлиентов;
	СписокКлиентов.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьЛистыОжидания(Команда)
	
	СозданоОбъектов = СоздатьЛистыОжиданияНаСервере();
	Предупреждение("Создано задач: " + Строка(СозданоОбъектов), 10, "Оповещение");
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция СоздатьЛистыОжиданияНаСервере()
	
	СчСозданных = 0;
	Для Каждого элКлиент Из СписокКлиентов Цикл 
		
		Если Не элКлиент.Пометка Тогда 
			Продолжить;
		КонецЕсли;
		
		ЛООбъект = Документы.ЛистОжидания.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ЛООбъект, ЭтаФорма);
		ЛООбъект.Дата = ТекущаяДата();
		ЛООбъект.Клиент = элКлиент.Значение;
		ЛООбъект.ДатаНачалаПлан = ПериодЗаписи.ДатаНачала;
		ЛООбъект.ДатаОкончанияПлан = ПериодЗаписи.ДатаОкончания;
		ЛООбъект.Сотрудник = Сотрудник;
		Если ЗначениеЗаполнено(Номенклатура) Тогда 
			НоваяСтрока = ЛООбъект.Работы.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
		КонецЕсли;
		ЛООбъект.Записать();
		
		СчСозданных = СчСозданных + 1;
		
	КонецЦикла;
	
	Возврат СчСозданных;
	
КонецФункции

#КонецОбласти
